samuelclay/turntouch-remote/firmware/nrf51/src/main.c
        case BLE_GAP_EVT_CONN_PARAM_UPDATE:
            rtt_print(0, "%sConnection params update\n", RTT_CTRL_TEXT_BLUE);
            break;
            
        case BLE_GATTS_EVT_WRITE:
            //p_evt_write = &p_ble_evt->evt.gatts_evt.params.write;
            //rtt_print(0, "%sGatt written to by client: %s%X\n", RTT_CTRL_TEXT_BLUE, RTT_CTRL_TEXT_BRIGHT_BLUE, p_evt_write);
            break;

        case BLE_EVT_USER_MEM_REQUEST:
        	rtt_print(0, "main -> BLE_EVT_USER_MEM_REQUEST\n");
            /*rtt_print(0, "%sBluetooth user mem request (%X)\n", RTT_CTRL_TEXT_BLUE, p_ble_evt->evt.gap_evt.conn_handle);
            m_mem_block.p_mem = &m_mem_queue[0];
            m_mem_block.len = MEM_BLOCK_SIZE;
            err_code = sd_ble_user_mem_reply(p_ble_evt->evt.gap_evt.conn_handle, &m_mem_block);
            APP_ERROR_CHECK(err_code);*/
            break;

        case BLE_EVT_USER_MEM_RELEASE:
        	rtt_print(0, "main -> BLE_EVT_USER_MEM_RELEASE\n");
            /*rtt_print(0, "%sBluetooth user mem release (%X, %X)\n", RTT_CTRL_TEXT_BLUE, p_ble_evt->evt.gap_evt.conn_handle, *((uint16_t *)m_mem_block.p_mem));
            if (p_ble_evt->evt.common_evt.params.user_mem_release.mem_block.p_mem == m_mem_block.p_mem) {
            
            }*/
            break;

        case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:
            rtt_print(0, "%sBluetooth RW authorize request: %X == %X/%x, %X\n", RTT_CTRL_TEXT_BLUE, p_ble_evt->evt.gatts_evt.params.write.op, BLE_GATTS_OP_PREP_WRITE_REQ, BLE_GATTS_OP_EXEC_WRITE_REQ_NOW, p_ble_evt->evt.gatts_evt.params.write.data[0]);
            m_rw_authorize_reply.params.write.gatt_status = BLE_GATT_STATUS_SUCCESS;
            m_rw_authorize_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
            
            err_code = sd_ble_gatts_rw_authorize_reply(m_conn_handle, &m_rw_authorize_reply);
            APP_ERROR_CHECK(err_code);
            break;

        default:
            // No implementation needed.
            rtt_print(0, "%sBluetooth event unhandled: %s%X(%d)%s\n", RTT_CTRL_TEXT_BLUE, RTT_CTRL_TEXT_BRIGHT_BLUE, p_ble_evt->header.evt_id, p_ble_evt->header.evt_len, RTT_CTRL_RESET);
            break;
    }
}

// ============
// = Services =
// ============

static void firmware_nickname_write_handler(ble_buttonservice_t *p_buttonservice, uint8_t* nickname,uint8_t length) {
     uint32_t err_code;

	//rtt_print(0, "New nickname : %s\n", nickname);
	memset(m_nickname_storage,0,FIRMWARE_NICKNAME_MAX_LENGTH);
    memcpy(m_nickname_storage, nickname, length);

	// flash must be cleared before saving new data to it
	err_code = pstorage_clear(&m_flash_handle,PSTORAGE_MAX_BLOCK_SIZE);

	APP_ERROR_CHECK(err_code);

}

static void pstorage_callback_handler(pstorage_handle_t * handle,
                                      uint8_t             op_code,
                                      uint32_t            reason,
                                      uint8_t           * p_data,
                                      uint32_t            param_len)
{
		
		switch(op_code)
    {
        case PSTORAGE_ERROR_OP_CODE:
						
            break;
        case PSTORAGE_STORE_OP_CODE: 
            if (reason != NRF_SUCCESS)
						{
								rtt_print(0, "pstorage store error: %x\n", reason);
						} else {
								rtt_print(0, "pstorage store success: \n");
								for (int i = 0; i <param_len; i++)
								{
										SEGGER_RTT_printf(0,"%02X ", p_data[i]);
								}
								SEGGER_RTT_printf(0,"\n");
								SEGGER_RTT_Write(0,p_data,param_len);
								SEGGER_RTT_printf(0,"\n");
						}        
            break;
        case PSTORAGE_LOAD_OP_CODE:
            if (reason != NRF_SUCCESS)
						{
								rtt_print(0, "pstorage load error: %x\n", reason);
						} else {
								rtt_print(0, "pstorage load success: \n");
								for (int i = 0; i <param_len; i++)
								{
										SEGGER_RTT_printf(0,"%02X ", p_data[i]);
								}
								SEGGER_RTT_printf(0,"\n\r");
								SEGGER_RTT_Write(0,p_data,param_len);
								SEGGER_RTT_printf(0,"\n\r");
						}
            break;
        case PSTORAGE_CLEAR_OP_CODE:
				if (reason != NRF_SUCCESS)
						{
								rtt_print(0, "pstorage clear error: %x\n", reason);
						} else {
								rtt_print(0, "pstorage clear success:\n");
								//save new nickname
                uint32_t err_code = pstorage_store(&m_flash_handle,
                       m_nickname_storage,
                       FIRMWARE_NICKNAME_MAX_LENGTH,
                       0);
								APP_ERROR_CHECK(err_code);
						}
            break;
        case PSTORAGE_UPDATE_OP_CODE:
                
            break;
        default:
                
            break;
    }
}


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t                err_code;
    ble_buttonstatus_init_t init;
    ble_bas_init_t          bas_init;
    ble_dis_init_t          dis_init;
    pstorage_module_param_t params;
    
    // Nickname
    init.firmware_nickname_write_handler = firmware_nickname_write_handler;
    
    params.block_size   = FIRMWARE_NICKNAME_MAX_LENGTH;
    params.block_count  = 1;
    params.cb           = pstorage_callback_handler;
    
    err_code = pstorage_register(&params, &m_flash_handle);
		APP_ERROR_CHECK(err_code);
    
		memset(init.nickname_str, 0, FIRMWARE_NICKNAME_MAX_LENGTH);
    memcpy(init.nickname_str, m_nickname_storage, FIRMWARE_NICKNAME_MAX_LENGTH);
    rtt_print(0, "Setting nickname: \n");
		
		err_code = pstorage_load(m_nickname_storage, &m_flash_handle, FIRMWARE_NICKNAME_MAX_LENGTH, 0);
		APP_ERROR_CHECK(err_code);
    

    // Button Service
    err_code = ble_buttonstatus_init(&m_buttonservice, &init);
    APP_ERROR_CHECK(err_code);

    // Battery Service
    memset(&bas_init, 0, sizeof(bas_init));
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_char_attr_md.cccd_write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_char_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&bas_init.battery_level_char_attr_md.write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_report_read_perm);

    bas_init.evt_handler          = NULL;
    bas_init.support_notification = true;
    bas_init.p_report_ref         = NULL;
    bas_init.initial_batt_level   = 100;

    err_code = ble_bas_init(&m_bas, &bas_init);
    APP_ERROR_CHECK(err_code);
    
